// Задайте строку, содержащую латинские буквы в обоих регистрах
//Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string str_1 = "HeLlO wOrLd";
string result = str_1.ToLower();

Console.WriteLine(result);